# 1.1. PROYECTO SQLüê¨
## LIMPIEZA DE DATOS


El primer paso ser√° realizar la limpieza de los datos contenidos en un total de

In [23]:
import pandas as pd
pd.set_option('display.max_columns', None)
import numpy as np
import pylab as plt
import seaborn as sns

## 1. LIMPIEZA DE LOS DATOS DENTRO DE CADA ARCHIVO .CSV:
**1.1. LIMPIEZA DE ARCHIVO 'ACTOR.CSV'**

In [5]:
act = pd.read_csv('../Data/actor.csv', encoding='latin1')   # Importamos el archivo 'actor.csv'
act.info(memory_usage = 'deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.1 KB

In [24]:
def check_nan(df: pd.DataFrame) -> None:        # Activamos la funci√≥n de % de nulos
    
    nan_cols = df.isna().mean() * 100  
    
    nan_cols = nan_cols[nan_cols>0]
    
    display(f'N nan cols: {len(nan_cols)}')
    display(nan_cols)
    
    
    plt.figure(figsize=(10, 6))  

    sns.heatmap(df.isna(),       
                yticklabels=False,  
                cmap='viridis',     
                cbar=False           
               )

    plt.show();

In [14]:
nan_cols = act.isna().sum()   # Comprobamos la cantidad de nulos por columna

nan_cols[nan_cols>0]   # En este caso, no existen nulos en el archivo 'actor'

Series([], dtype: int64)

In [44]:
# Se observa que la columna last_update tiene el mismo valor tanto en la fecha como en la hora, as√≠ que eliminamos

act.drop(columns = ['last_update'], inplace=True)
act

     actor_id first_name     last_name
0           1   PENELOPE       GUINESS
1           2       NICK      WAHLBERG
2           3         ED         CHASE
3           4   JENNIFER         DAVIS
4           5     JOHNNY  LOLLOBRIGIDA
..        ...        ...           ...
195       196       BELA        WALKEN
196       197      REESE          WEST
197       198       MARY        KEITEL
198       199      JULIA       FAWCETT
199       200      THORA        TEMPLE

[200 rows x 3 columns]

In [39]:
# Comprobamos si hay duplicados, no hay.

act.duplicated().any()

False

**1.2. LIMPIEZA DE ARCHIVO 'CATEGORY.CSV'**

In [40]:
cat = pd.read_csv('../Data/category.csv', encoding='latin1')
cat

    category_id         name          last_update
0             1       Action  2006-02-15 04:46:27
1             2    Animation  2006-02-15 04:46:27
2             3     Children  2006-02-15 04:46:27
3             4     Classics  2006-02-15 04:46:27
4             5       Comedy  2006-02-15 04:46:27
5             6  Documentary  2006-02-15 04:46:27
6             7        Drama  2006-02-15 04:46:27
7             8       Family  2006-02-15 04:46:27
8             9      Foreign  2006-02-15 04:46:27
9            10        Games  2006-02-15 04:46:27
10           11       Horror  2006-02-15 04:46:27
11           12        Music  2006-02-15 04:46:27
12           13          New  2006-02-15 04:46:27
13           14       Sci-Fi  2006-02-15 04:46:27
14           15       Sports  2006-02-15 04:46:27
15           16       Travel  2006-02-15 04:46:27

In [ ]:
film = pd.read_csv('../Data/film.csv', encoding='latin1')

In [ ]:
inv = pd.read_csv('../Data/inventory.csv', encoding='latin1')

In [ ]:
lan = pd.read_csv('../Data/language.csv', encoding='latin1')

In [ ]:
old = pd.read_csv('../Data/old_HDD.csv', encoding='latin1')

In [ ]:
rent = pd.read_csv('../Data/rental.csv', encoding='latin1')